tests/cassettes/webservice.test_rms.TestRMS.test_rms_order.yaml

interactions:
- request:
    body: "<?xml version='1.0' encoding='utf-8'?>\n<soap-env:Envelope xmlns:soap-env=\"\
      http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap-env:Body>\n    <ns0:getRequestId\
      \ xmlns:ns0=\"http://orderapi.rms.rakuten.co.jp/rms/mall/order/api/ws\">\n \
      \     <arg0>\n        <authKey>XXXXXX</authKey>\n        <shopUrl></shopUrl>\n\
      \        <userName></userName>\n      </arg0>\n    </ns0:getRequestId>\n  </soap-env:Body>\n\
      </soap-env:Envelope>\n"
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['476']
      Content-Type: [text/xml; charset=utf-8]
      SOAPAction: ['""']
      User-Agent: [python-requests/2.12.0]
    method: POST
    uri: https://api.rms.rakuten.co.jp/es/1.0/order/ws
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA3WQO07DQBCGr2KlcZWddaQIy1pvJBBINBQJHGBljxyD98HOOkBLwUWoKZEizsPj
        GqyVGFd0v77555+HWD3qLtmhp9aaMs0YTxM0la1b05TpzfXFPE9XUmyKc7PDzjpMot9QsSln2xBc
        AUDVFrUiFjlZ5Zj1DQwC8NgBs6H/1NZPUhhaFA2GNd73SOGyXiM5a2hMjeW/XOtr9Mq1zGtiXt31
        AQ2rLLt1EAlo1XUHD0QTPFCc4jH03kiB3lt/ZmuUV5zPOecCJiQ0EqkG5ffb69d+//P+/PnxImCk
        MeS4m8zyLF9my5OFgAkO+jAF/jsmlsZ7YXqc/AWKRcVqawEAAA==
    headers:
      Connection: [close]
      Content-Encoding: [gzip]
      Content-Length: ['265']
      Content-Type: [text/xml;charset="utf-8"]
      Date: ['Thu, 01 Dec 2016 19:10:59 GMT']
      Server: [nginx]
      Vary: [Accept-Encoding]
      X-Powered-By: [Servlet/2.5 JSP/2.1]
      requestId: [f0e2977e-e704-4b57-b4a3-796e9913bfa9]
      timeStamp: ['2016-12-01T19:10:59']
    status: {code: 200, message: OK}
version: 1
